toasterllc/MDCCode/Code/STM32/Shared/USB.h
    static void EndpointReset(uint8_t ep) {
        Toastbox::IntState ints(false);
        _EndpointReset(ep);
        
        T_Scheduler::Ctx(ep);
        T_Scheduler::Wait([] { return _EndpointReady(T_Scheduler::template Ctx<uint8_t>()); });
    }
    
    static void EndpointsReset() {
        Toastbox::IntState ints(false);
        for (uint8_t ep : T_Config::Endpoints) {
            _EndpointReset(ep);
        }
        T_Scheduler::Wait([] { return _EndpointsReady(); });
    }
    
    #define BOT_GET_MAX_LUN     0xFE
    #define BOT_RESET           0xFF
    
    static void USBD_MSC_Setup(const Toastbox::USB::SetupRequest& req) {
        switch (req.bmRequestType & Toastbox::USB::RequestType::TypeMask) {
        case USB_REQ_TYPE_CLASS:
            switch (req.bRequest) {
            case BOT_GET_MAX_LUN:
                toaster_printf("USBD_MSC_Setup-BOT_GET_MAX_LUN\n");
                
                if (!req.wValue && req.wLength==1 && (req.bmRequestType & 0x80)) {
                    alignas(void*)
                    static uint8_t maxLun = 0;
                    
                    Send(0x80, (uint8_t*)&maxLun, sizeof(maxLun));
                    Recv(0x00, nullptr, 0);
                    return;
                }
                AssertLED(false);
                break;
            
            case BOT_RESET:
                AssertLED(false);
                break;
    //            if ((req.wValue  == 0U) && (req.wLength == 0U) && ((req.bmRequestType & 0x80U) != 0x80U)) {
    //                return MSC_BOT_Reset(pdev);
    //            }
    //            break;
            
            default: break;
            }
        }
        AssertLED(false);
        _CmdAccept(false);
    }
    
    static void USBD_GetDescriptor(const Toastbox::USB::SetupRequest& req) {
        uint16_t len = 0U;
        uint8_t *pbuf = NULL;
        uint8_t err = 0U;
        
        switch (req.wValue >> 8) {
        case USB_DESC_TYPE_BOS:
            toaster_printf("GetDescriptor-BOS\n");
            
            if (_Device.pDesc->GetBOSDescriptor != NULL) {
                pbuf = _Device.pDesc->GetBOSDescriptor(_Device.dev_speed, &len);
            } else {
                AssertLED(false);
                _CmdAccept(false);
                err++;
            }
            break;
        
        case USB_DESC_TYPE_DEVICE:
            toaster_printf("GetDescriptor-Device\n");
            
            pbuf = _Device.pDesc->GetDeviceDescriptor(_Device.dev_speed, &len);
            break;
        
        case USB_DESC_TYPE_CONFIGURATION:
            toaster_printf("GetDescriptor-Config\n");
            
            if (_Device.dev_speed == USBD_SPEED_HIGH) {
                pbuf = _Device.pClass->GetHSConfigDescriptor(&_Device, &len);
            } else {
                pbuf = _Device.pClass->GetFSConfigDescriptor(&_Device, &len);
            }
            break;
        
        case USB_DESC_TYPE_STRING:
            switch ((uint8_t)(req.wValue)) {
            case USBD_IDX_LANGID_STR:
                if (_Device.pDesc->GetLangIDStrDescriptor != NULL) {
                    pbuf = _Device.pDesc->GetLangIDStrDescriptor(_Device.dev_speed, &len);
                } else {
                    AssertLED(false);
                    _CmdAccept(false);
                    err++;
                }
                break;
            
            case USBD_IDX_MFC_STR:
                if (_Device.pDesc->GetManufacturerStrDescriptor != NULL) {
                    pbuf = _Device.pDesc->GetManufacturerStrDescriptor(_Device.dev_speed, &len);
                } else {
                    AssertLED(false);
                    _CmdAccept(false);
                    err++;
                }
                break;
            
            case USBD_IDX_PRODUCT_STR:
                if (_Device.pDesc->GetProductStrDescriptor != NULL) {
                    pbuf = _Device.pDesc->GetProductStrDescriptor(_Device.dev_speed, &len);
                } else {
                    AssertLED(false);
                    _CmdAccept(false);
                    err++;
                }
                break;
            
            case USBD_IDX_SERIAL_STR:
                if (_Device.pDesc->GetSerialStrDescriptor != NULL) {
                    pbuf = _Device.pDesc->GetSerialStrDescriptor(_Device.dev_speed, &len);
                
                } else {
                    AssertLED(false);
                    _CmdAccept(false);
                    err++;
                }
                break;
            
            case USBD_IDX_CONFIG_STR:
                if (_Device.pDesc->GetConfigurationStrDescriptor != NULL) {
                    pbuf = _Device.pDesc->GetConfigurationStrDescriptor(_Device.dev_speed, &len);
                } else {
                    AssertLED(false);
                    _CmdAccept(false);
                    err++;
                }
                break;
            
            case USBD_IDX_INTERFACE_STR:
                if (_Device.pDesc->GetInterfaceStrDescriptor != NULL) {
                    pbuf = _Device.pDesc->GetInterfaceStrDescriptor(_Device.dev_speed, &len);
                } else {
                    AssertLED(false);
                    _CmdAccept(false);
                    err++;
                }
                break;
            
            default:
                if (_Device.pClass->GetUsrStrDescriptor != NULL) {
                    pbuf = _Device.pClass->GetUsrStrDescriptor(&_Device, (req.wValue), &len);
                
                } else {
                    AssertLED(false);
                    _CmdAccept(false);
                    err++;
                }
                break;
            }
            break;

        default:
            AssertLED(false);
            _CmdAccept(false);
            err++;
            break;
        }
        
        if (err != 0U) {
            return;
        
        } else {
            if (req.wLength != 0U) {
                if (len != 0U) {
                    len = MIN(len, req.wLength);
                    Send(0x80, pbuf, len);
                    Recv(0x00, nullptr, 0);
                } else {
                    AssertLED(false);
                    _CmdAccept(false);
                }
            
            } else {
                _CmdAccept(true);
            }
        }
    }
    
    static void USBD_SetAddress(const Toastbox::USB::SetupRequest& req) {
        toaster_printf("USBD_SetAddress\n");
        if (req.wIndex==0 && req.wLength==0 && req.wValue<128) {
            const uint8_t dev_addr = (uint8_t)(req.wValue) & 0x7F;
            if (_Device.dev_state != USBD_STATE_CONFIGURED) {
                _Device.dev_address = dev_addr;
                (void)USBD_LL_SetUSBAddress(&_Device, dev_addr);
                
                if (dev_addr) {
                    _Device.dev_state = USBD_STATE_ADDRESSED;
                } else {
                    _Device.dev_state = USBD_STATE_DEFAULT;
                }
                return _CmdAccept(true);
            }
        }
        AssertLED(false);
        _CmdAccept(false);
    }

    static void USBD_SetConfig(const Toastbox::USB::SetupRequest& req) {
        toaster_printf("USBD_SetConfig\n");
        USBD_StatusTypeDef ret = USBD_OK;
        static uint8_t cfgidx;
        
        cfgidx = (uint8_t)(req.wValue);
        
        if (cfgidx > USBD_MAX_NUM_CONFIGURATION) {
            AssertLED(false);
            return _CmdAccept(false);
        }

        switch (_Device.dev_state) {
        case USBD_STATE_ADDRESSED:
            if (cfgidx != 0U) {
                _Device.dev_config = cfgidx;

