toasterllc/MDCCode/Code/STM32/Shared/USB.h
                ret = USBD_SetClassConfig(&_Device, cfgidx);

                if (ret != USBD_OK) {
                    AssertLED(false);
                    _CmdAccept(false);
                } else {
                    _CmdAccept(true);
                    _Device.dev_state = USBD_STATE_CONFIGURED;
                }
            
            } else {
                _CmdAccept(true);
            }
            break;
        
        case USBD_STATE_CONFIGURED:
            if (cfgidx == 0U) {
                _Device.dev_state = USBD_STATE_ADDRESSED;
                _Device.dev_config = cfgidx;
                (void)USBD_ClrClassConfig(&_Device, cfgidx);
                _CmdAccept(true);
            
            } else if (cfgidx != _Device.dev_config) {
                /* Clear old configuration */
                (void)USBD_ClrClassConfig(&_Device, (uint8_t)_Device.dev_config);
                /* set new configuration */
                _Device.dev_config = cfgidx;
                ret = USBD_SetClassConfig(&_Device, cfgidx);
                if (ret != USBD_OK) {
                    AssertLED(false);
                    _CmdAccept(false);
                    (void)USBD_ClrClassConfig(&_Device, (uint8_t)_Device.dev_config);
                    _Device.dev_state = USBD_STATE_ADDRESSED;
                
                } else {
                    _CmdAccept(true);
                }
            
            } else {
                _CmdAccept(true);
            }
            break;
        
        default:
            AssertLED(false);
            _CmdAccept(false);
            (void)USBD_ClrClassConfig(&_Device, cfgidx);
            ret = USBD_FAIL;
            break;
        }
    }

    static void USBD_GetConfig(const Toastbox::USB::SetupRequest& req) {
        AssertLED(false);
//        if (req.wLength != 1U)
//        {
//        _CmdAccept(false);
//        }
//        else
//        {
//        switch (_Device.dev_state)
//        {
//        case USBD_STATE_DEFAULT:
//        case USBD_STATE_ADDRESSED:
//        _Device.dev_default_config = 0U;
//        Send(0x80, (uint8_t*)&_Device.dev_default_config, 1);
//        AssertLED(false);
//        break;
//        case USBD_STATE_CONFIGURED:
//        Send(0x80, (uint8_t*)&_Device.dev_config, 1);
//        AssertLED(false);
//        break;
//        default:
//        _CmdAccept(false);
//        break;
//        }
//        }
    }
    
    static void USBD_GetStatus(const Toastbox::USB::SetupRequest& req) {
        AssertLED(false);
//        switch (_Device.dev_state) {
//        case USBD_STATE_DEFAULT:
//        case USBD_STATE_ADDRESSED:
//        case USBD_STATE_CONFIGURED:
//            if (req.wLength != 0x2U) {
//                _CmdAccept(false);
//                break;
//            }
//            
//#if (USBD_SELF_POWERED == 1U)
//                _Device.dev_config_status = USB_CONFIG_SELF_POWERED;
//#else
//                _Device.dev_config_status = 0U;
//#endif
//            
//            if (_Device.dev_remote_wakeup != 0U) {
//                _Device.dev_config_status |= USB_CONFIG_REMOTE_WAKEUP;
//            }
//            
//            Send(0x80, (uint8_t*)&_Device.dev_config_status, 2);
//            AssertLED(false);
//            break;
//        
//        default:
//            _CmdAccept(false);
//            break;
//        }
    }
    
    static void USBD_SetFeature(const Toastbox::USB::SetupRequest& req) {
        AssertLED(false);
//    if (req.wValue == USB_FEATURE_REMOTE_WAKEUP)
//    {
//    _Device.dev_remote_wakeup = 1U;
//    _CmdAccept(true);
//    }
    }
    
    static void USBD_ClrFeature(const Toastbox::USB::SetupRequest& req) {
        AssertLED(false);
//        switch (_Device.dev_state) {
//        case USBD_STATE_DEFAULT:
//        case USBD_STATE_ADDRESSED:
//        case USBD_STATE_CONFIGURED:
//            if (req.wValue == USB_FEATURE_REMOTE_WAKEUP) {
//                _Device.dev_remote_wakeup = 0U;
//                return _CmdAccept(true);
//            }
//            break;
//        }
//        _CmdAccept(false);
    }
    
    static void USBD_StdDevReq(const Toastbox::USB::SetupRequest& req) {
        switch (req.bmRequestType & Toastbox::USB::RequestType::TypeMask) {
        case USB_REQ_TYPE_CLASS:
            AssertLED(false);
            return USBD_MSC_Setup(req);
//        case USB_REQ_TYPE_VENDOR:
//            _CmdAccept(false);
//            break;
        case USB_REQ_TYPE_STANDARD: {
            switch (req.bRequest) {
            case USB_REQ_GET_DESCRIPTOR:    return USBD_GetDescriptor(req);
            case USB_REQ_SET_ADDRESS:       return USBD_SetAddress(req);
            case USB_REQ_SET_CONFIGURATION: return USBD_SetConfig(req);
            case USB_REQ_GET_CONFIGURATION: return USBD_GetConfig(req);
            case USB_REQ_GET_STATUS:        return USBD_GetStatus(req);
            case USB_REQ_SET_FEATURE:       return USBD_SetFeature(req);
            case USB_REQ_CLEAR_FEATURE:     return USBD_ClrFeature(req);
            default:                        break;
            }
        }}
        AssertLED(false);
        _CmdAccept(false);
    }
    
    static void USBD_StdItfReq(const Toastbox::USB::SetupRequest& req) {
        alignas(void*)
        const uint8_t status[2] = {};
        
        switch (req.bmRequestType & Toastbox::USB::RequestType::TypeMask) {
        case USB_REQ_TYPE_CLASS:
            return USBD_MSC_Setup(req);
        
        case USB_REQ_TYPE_STANDARD: {
            switch (req.bRequest) {
            case USB_REQ_GET_STATUS:
                Send(0x80, status, sizeof(status));
                Recv(0x00, nullptr, 0);
                return;
                
            case USB_REQ_CLEAR_FEATURE:     AssertLED(false);
            case USB_REQ_SET_FEATURE:       AssertLED(false);
            case USB_REQ_GET_INTERFACE:     AssertLED(false);
            case USB_REQ_SET_INTERFACE:     AssertLED(false);
            default:                        break;
            }
            break;
        }}
        
        
        
        AssertLED(false);
        _CmdAccept(false);
    }

    static void USBD_StdEPReq(const Toastbox::USB::SetupRequest& req) {
        alignas(void*)
        const uint8_t status[2] = {};
        
        switch (req.bmRequestType & Toastbox::USB::RequestType::TypeMask) {
        case USB_REQ_TYPE_STANDARD: {
            switch (req.bRequest) {
            case USB_REQ_GET_STATUS:
                Send(0x80, status, sizeof(status));
                Recv(0x00, nullptr, 0);
                return;
                
            case USB_REQ_CLEAR_FEATURE:
                if (req.wValue == USB_FEATURE_EP_HALT) {
                    return _CmdAccept(true);
                } else {
                    AssertLED(false);
                }
                
            case USB_REQ_SET_FEATURE:       AssertLED(false);
            case USB_REQ_GET_INTERFACE:     AssertLED(false);
            case USB_REQ_SET_INTERFACE:     AssertLED(false);
            default:                        break;
            }
            break;
        }}
        AssertLED(false);
        _CmdAccept(false);
    }
    
    static void _SetupRequestHandle(const Toastbox::USB::SetupRequest& req) {
        toaster_printf("_SetupRequestHandle 0x%x 0x%x\n", req.bmRequestType, req.bRequest);
        
        switch (req.bmRequestType & Toastbox::USB::RequestType::RecipientMask) {
        case USB_REQ_RECIPIENT_DEVICE:    return USBD_StdDevReq(req);
        case USB_REQ_RECIPIENT_INTERFACE: return USBD_StdItfReq(req);
        case USB_REQ_RECIPIENT_ENDPOINT:  return USBD_StdEPReq(req);
        }
        AssertLED(false);
        _CmdAccept(false);
    }
    
    struct [[gnu::packed]] CBW {
        uint32_t dSignature;
        uint32_t dTag;
        uint32_t dDataLength;
        uint8_t  bmFlags;
        uint8_t  bLUN;
        uint8_t  bCBLength;
        uint8_t  CB[16];
    };
    
    struct [[gnu::packed]] CSW {
        uint32_t dSignature;
        uint32_t dTag;
        uint32_t dDataResidue;
        uint8_t  bStatus;
    };
    
