toasterllc/MDCCode/Code/STM32/Shared/USB.h
        toaster_printf("SCSI_Read10 SENT\n");
    }
    
    static const STM::Cmd* SCSI_Write10(uint8_t lun, const uint8_t* params) {
        toaster_printf("SCSI_Write10-START\n");
        
        struct [[gnu::packed]] {
            uint8_t op;
            uint8_t flags;
            uint32_t blockAddr;
            uint8_t groupNumber;
            uint16_t blockLen;
            uint8_t control;
        } cmd;
        
        memcpy(&cmd, params, sizeof(cmd));
        cmd.blockAddr = Toastbox::Endian::HFB_U32(cmd.blockAddr);
        cmd.blockLen = Toastbox::Endian::HFB_U16(cmd.blockLen);
        
//        const uint8_t* Fs = (const uint8_t*)&Filesystem::_Data;
//        const uint8_t* DataStartAddr = (const uint8_t*)&Filesystem::_Data.data;
        const size_t off = cmd.blockAddr*Filesystem::_BytesPerSector;
//        const uint8_t* addr = Fs+off;
        const size_t len = cmd.blockLen*Filesystem::_BytesPerSector;
        size_t rem = len;
        
        constexpr size_t DataOffset = offsetof(decltype(Filesystem::_Data), data);
        
        alignas(void*)
        static union [[gnu::packed]] {
            STM::Cmd cmd;
            uint8_t _[512];
        } packet = {};
        static_assert(sizeof(packet) == 512);
        
        const STM::Cmd* result = nullptr;
        
    //    if (addr < DataStartAddr) {
    //        toaster_printf("SCSI_Write10-addr < DataStartAddr\n");
    //        AssertLED(false);
    //    }
        
        // This is a STM::Cmd being written
        if (off == DataOffset) {
//            AssertXXX(false);
            
            if (rem < sizeof(packet)) {
                AssertXXX(false);
            }
            
            Recv(0x01, &packet, sizeof(packet));
            rem -= sizeof(packet);
            result = &packet.cmd;
        }
        
        while (rem) {
            uint8_t* MassData = (uint8_t*)0x20010000;
            constexpr size_t ChunkLen = 63*1024;
            
            const size_t chunkLen = std::min(rem, ChunkLen);
            Recv(0x01, MassData, chunkLen);
            rem -= chunkLen;
        }
        
        return result;
        
//        if (off == DataOffset) {
//        {
//        
//        
//        // This is something else being written
//        } else {
//            while (rem) {
//                uint8_t* MassData = (uint8_t*)0x20010000;
//                constexpr size_t ChunkLen = 63*1024;
//                
//                const size_t chunkLen = std::min(rem, ChunkLen);
//                Recv(0x01, MassData, chunkLen);
//                rem -= chunkLen;
//            }
//            
//            return nullptr;
//        }
    }

    
    
    
    
    static void SendStatus(bool s) {
        bool done = false;
        while (!done) {
            alignas(void*)
            static union [[gnu::packed]] {
                CBW cbw;
                uint8_t _[512];
            } packet = {};
            
            static_assert(sizeof(packet) == MaxPacketSizeIn());
            static_assert(sizeof(packet) == 512);
            
            const std::optional<size_t> len = Recv(0x01, &packet, sizeof(packet));
            if (!len) break;
            
            AssertLED(*len == sizeof(CBW));
            AssertLED(packet.cbw.dSignature == 0x43425355);
            AssertLED(packet.cbw.bLUN == 0);
            AssertLED(packet.cbw.bCBLength > 0);
            AssertLED(packet.cbw.bCBLength < 16);
            
            #define SCSI_TEST_UNIT_READY                        0x00U
            #define SCSI_INQUIRY                                0x12U
            #define SCSI_MODE_SENSE6                            0x1AU
            #define SCSI_ALLOW_MEDIUM_REMOVAL                   0x1EU
            #define SCSI_READ_CAPACITY10                        0x25U
            #define SCSI_READ10                                 0x28U
            #define SCSI_WRITE10                                0x2AU
            
            const uint8_t lun = packet.cbw.bLUN;
            const uint8_t* cb = &packet.cbw.CB[0];
            switch (cb[0]) {
            case SCSI_TEST_UNIT_READY:          SCSI_TestUnitReady(lun, cb); break;
            case SCSI_INQUIRY:                  SCSI_Inquiry(lun, cb); break;
            case SCSI_ALLOW_MEDIUM_REMOVAL:     SCSI_AllowPreventRemovable(lun, cb); break;
            case SCSI_MODE_SENSE6:              SCSI_ModeSense6(lun, cb); break;
            case SCSI_READ_CAPACITY10:          SCSI_ReadCapacity10(lun, cb); break;
            case SCSI_READ10:                   SCSI_Read10(lun, cb, s); done=true; break;
            case SCSI_WRITE10:                  SCSI_Write10(lun, cb); break;
            }
            
            MSC_BOT_SendCSW(packet.cbw.dTag, 0, 0);
        }
    }
    
    static void AcceptCommand(bool s) {
        SendStatus(s);
    }
    
    
    
    
    
    static const STM::Cmd& SCSIHandle() {
        Toastbox::IntState ints(false);
        for (;;) {
            T_Scheduler::Wait([] { return _State == State::Connected; });
            
            // XXX: wait for enumeration
            // XXX: why is this necessary?
            // XXX: fixme
            T_Scheduler::Sleep(T_Scheduler::template Ms<100>);
            
            for (;;) {
                alignas(void*)
                static union [[gnu::packed]] {
                    CBW cbw;
                    uint8_t _[512];
                } packet = {};
                
                static_assert(sizeof(packet) == MaxPacketSizeIn());
                static_assert(sizeof(packet) == 512);
                
                const std::optional<size_t> len = Recv(0x01, &packet, sizeof(packet));
                if (!len) break;
                
                AssertLED(*len == sizeof(CBW));
                AssertLED(packet.cbw.dSignature == 0x43425355);
                AssertLED(packet.cbw.bLUN == 0);
                AssertLED(packet.cbw.bCBLength > 0);
                AssertLED(packet.cbw.bCBLength < 16);
                
                #define SCSI_TEST_UNIT_READY                        0x00U
                #define SCSI_INQUIRY                                0x12U
                #define SCSI_MODE_SENSE6                            0x1AU
                #define SCSI_ALLOW_MEDIUM_REMOVAL                   0x1EU
                #define SCSI_READ_CAPACITY10                        0x25U
                #define SCSI_READ10                                 0x28U
                #define SCSI_WRITE10                                0x2AU
                
                const uint8_t lun = packet.cbw.bLUN;
                const uint8_t* cb = &packet.cbw.CB[0];
                const STM::Cmd* cmd = nullptr;
                switch (cb[0]) {
                case SCSI_TEST_UNIT_READY:          SCSI_TestUnitReady(lun, cb); break;
                case SCSI_INQUIRY:                  SCSI_Inquiry(lun, cb); break;
                case SCSI_ALLOW_MEDIUM_REMOVAL:     SCSI_AllowPreventRemovable(lun, cb); break;
                case SCSI_MODE_SENSE6:              SCSI_ModeSense6(lun, cb); break;
                case SCSI_READ_CAPACITY10:          SCSI_ReadCapacity10(lun, cb); break;
                case SCSI_READ10:                   SCSI_Read10(lun, cb); break;
                case SCSI_WRITE10:                  cmd = SCSI_Write10(lun, cb); break;
                }
                
                MSC_BOT_SendCSW(packet.cbw.dTag, 0, 0);
                if (cmd) return *cmd;
            }
        }
    }
    
    static void TaskEP0() {
        Toastbox::IntState ints(false);
        for (;;) {
            T_Scheduler::Wait([] { return _State == State::Connecting || _State == State::Connected; });
            if (_State == State::Connecting) {
                // Update our state
                _State = State::Connected;
                _SetupRequest = std::nullopt;
            }
            
            // Wait for a command
            for (;;) {
                // Wait for a new command to arrive, or for our state to change
                T_Scheduler::Wait([] { return _SetupRequest || _State!=State::Connected; });
                
