toasterllc/MDCCode/Code/STM32/Shared/USB.h
                // If we're no longer connected, bail and wait to be connected again
                if (_State != State::Connected) break;
                
                // Handle the setup request
                _SetupRequestHandle(*_SetupRequest);
                
                // Consume the command
                _SetupRequest = std::nullopt;
            }
        }
    }
    
    
    
    static void CmdAccept(bool accept) {
        Toastbox::IntState ints(false);
        // Short-circuit if we're not Connected
        if (_State != State::Connected) return;
        _CmdAccept(accept);
    }
    
    static std::optional<size_t> Recv(uint8_t ep, void* data, size_t len) {
        AssertLED(EndpointOut(ep));
        _EndpointState& eps = _EndpointStateGet(ep);
        
        Toastbox::IntState ints(false);
        if (_State != State::Connected) return std::nullopt; // Short-circuit if we're not Connected
        
        AssertLED(_Ready(eps));
        _AdvanceStateOut(ep);
        
        if (len) {
            const USBD_StatusTypeDef us = USBD_LL_PrepareReceive(&_Device, ep, (uint8_t*)data, len);
            AssertLED(us == USBD_OK);
        
        } else {
            const USBD_StatusTypeDef us = USBD_LL_PrepareReceiveZeroLen(&_Device, ep);
            AssertLED(us == USBD_OK);
        }
        
        _WaitState ws = { .ep = ep };
        T_Scheduler::Ctx(&ws); // Set current task's context, which we'll retrieve from the Wait() lambda
        T_Scheduler::Wait([] { return _WaitRecv(*T_Scheduler::template Ctx<_WaitState*>()); });
        if (!ws.ok) return std::nullopt;
        return ws.len;
    }
    
    static bool Send(uint8_t ep, const void* data, size_t len) {
        AssertLED(EndpointIn(ep));
        _EndpointState& eps = _EndpointStateGet(ep);
        
        Toastbox::IntState ints(false);
        if (_State != State::Connected) return false; // Short-circuit if we're not Connected
        
        AssertLED(_Ready(eps));
        _AdvanceStateIn(ep);
        
        if (len) {
            const USBD_StatusTypeDef us = USBD_LL_Transmit(&_Device, ep, (uint8_t*)data, len);
            AssertLED(us == USBD_OK);
        
        } else {
            const USBD_StatusTypeDef us = USBD_LL_TransmitZeroLen(&_Device, ep);
            AssertLED(us == USBD_OK);
        }
        
        _WaitState ws = { .ep = ep };
        T_Scheduler::Ctx(&ws); // Set current task's context, which we'll retrieve from the Wait() lambda
        T_Scheduler::Wait([] { return _WaitSend(*T_Scheduler::template Ctx<_WaitState*>()); });
        return ws.ok;
    }
    
    static void ISR() {
        ISR_HAL_PCD(&_PCD);
    }
    
private:
    static uint8_t _USBD_Init(uint8_t cfgidx) {
        toaster_printf("_USBD_Init\n");
        
        // Open endpoints
        for (uint8_t ep : T_Config::Endpoints) {
            if (EndpointOut(ep)) {
                USBD_LL_OpenEP(&_Device, ep, USBD_EP_TYPE_BULK, MaxPacketSizeOut());
                _Device.ep_out[EndpointIdx(ep)].is_used = 1U;
            
            } else {
                USBD_LL_OpenEP(&_Device, ep, USBD_EP_TYPE_BULK, MaxPacketSizeIn());
                _Device.ep_in[EndpointIdx(ep)].is_used = 1U;
            }
            
            // Reset endpoint state
            _EndpointStateGet(ep) = {};
        }
        
        _State = State::Connecting;
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_DeInit(uint8_t cfgidx) {
        toaster_printf("_USBD_DeInit\n");
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Suspend() {
        toaster_printf("_USBD_Suspend\n");
        _State = State::Disconnected;
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Resume() {
        toaster_printf("_USBD_Suspend\n");
        _State = State::Connected;
        return (uint8_t)USBD_OK;
    }
    
//  USBD_StatusTypeDef ret;
//
//  USBD_ParseSetupRequest(&pdev->request, psetup);
//
//  pdev->ep0_state = USBD_EP0_SETUP;
//
//  pdev->ep0_data_len = pdev->request.wLength;
//
//  switch (pdev->request.bmRequestType & 0x1FU)
//  {
//    case USB_REQ_RECIPIENT_DEVICE:
//      ret = USBD_StdDevReq(pdev, &pdev->request);
//      break;
//
//    case USB_REQ_RECIPIENT_INTERFACE:
//      ret = USBD_StdItfReq(pdev, &pdev->request);
//      break;
//
//    case USB_REQ_RECIPIENT_ENDPOINT:
//      ret = USBD_StdEPReq(pdev, &pdev->request);
//      break;
//
//    default:
//      ret = USBD_LL_StallEP(pdev, (pdev->request.bmRequestType & 0x80U));
//      break;
//  }
//
//  return ret;
    
    static uint8_t _USBD_Setup(const Toastbox::USB::SetupRequest& req) {
        if (_SetupRequest) {
            AssertLED(false);
            _CmdAccept(false);
            return (uint8_t)USBD_FAIL;
        }
        
        _SetupRequest = req;
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_EP0_TxSent() {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_EP0_RxReady() {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_DataIn(uint8_t epidx) {
        const uint8_t ep = Toastbox::USB::Endpoint::DirectionIn | epidx;
        // Sanity-check the endpoint state
        _EndpointState& eps = _EndpointStateGet(ep);
        AssertLED(
            eps.stage == _EndpointStage::ResetZLP1     ||
            eps.stage == _EndpointStage::ResetZLP2     ||
            eps.stage == _EndpointStage::ResetSentinel ||
            eps.stage == _EndpointStage::Busy
        );
        _AdvanceStateIn(ep);
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_DataOut(uint8_t epidx) {
        const uint8_t ep = Toastbox::USB::Endpoint::DirectionOut | epidx;
        _EndpointState& eps = _EndpointStateGet(ep);
        // Sanity-check the endpoint state
        AssertLED(
            eps.stage == _EndpointStage::ResetZLP1     ||
            eps.stage == _EndpointStage::ResetZLP2     ||
            eps.stage == _EndpointStage::ResetSentinel ||
            eps.stage == _EndpointStage::Busy
        );
        _AdvanceStateOut(ep);
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_SOF() {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_IsoINIncomplete(uint8_t ep) {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_IsoOUTIncomplete(uint8_t ep) {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t* _USBD_GetHSConfigDescriptor(uint16_t* len) {
        *len = sizeof(T_Config::Descriptor);
        return (uint8_t*)&T_Config::Descriptor;
    }
    
